#+TITLE: Structure and Interpretation of Computer Programs
#+STARTUP: nohideblocks

#+name: commentify
#+begin_src emacs-lisp :var result="" :exports none
(concat ";=> " (format "%s" result))
#+end_src

#+RESULTS: commentify
: ;=> 

/Attribution:/ Harold Abelson and Gerald Jay Sussman with Julie Sussman, foreword by Alan J. Perlis, ©1996 by The Massachusetts Institute of Technology, licensed under the Creative Commons Attribution-ShareAlike 4.0 International License (CC BY-SA 4.0). Notes, (modified or adjusted) excerpts, and exercises by @leinfink.

**** Representing rational numbers

#+begin_src scheme :exports both 
  (define (make-rat n d) (cons n d))
  (define (numer x) (car x))
  (define (denom x) (cdr x))

  (define (print-rat x)
    (newline)
    (display (numer x))
    (display "/")
    (display (denom x)))
#+end_src

#+RESULTS:
: ;=> #<void>

#+begin_src scheme :exports both 
(define (add-rat x y)
  (make-rat (+ (* (numer x) (denom y))
               (* (numer y) (denom x)))
            (* (denom x) (denom y))))

(define (sub-rat x y)
  (make-rat (- (* (numer x) (denom y))
               (* (numer y) (denom x)))
            (* (denom x) (denom y))))

(define (mul-rat x y)
  (make-rat (* (numer x) (numer y))
            (* (denom x) (denom y))))

(define (div-rat x y)
  (make-rat (* (numer x) (denom y))
            (* (denom x) (numer y))))

(define (equal-rat? x y)
  (= (* (numer x) (denom y))
     (* (numer y) (denom x))))
#+end_src

#+RESULTS:
: ;=> #<void>

#+begin_src scheme :exports both :results output
  (define one-half (make-rat 1 2))
  (print-rat one-half)

  (define one-third (make-rat 1 3))
  (print-rat
   (add-rat one-half one-third))

  (print-rat
   (mul-rat one-half one-third))

  (print-rat
   (add-rat one-third one-third))
#+end_src

#+RESULTS:
: ;=> 
: 1/2
: 5/6
: 1/6
: 6/9


#+begin_src scheme :exports both :results output
    (define (gcd a b)
      (if (= b 0)
	  a
	  (gcd b (remainder a b))))

  (define (make-rat n d)
    (let ((g (gcd n d)))
      (cons (/ n g) 
	    (/ d g))))
  
  (print-rat
   (add-rat one-third one-third))

#+end_src

#+RESULTS:
: ;=> 
: 2/3

**** TODO Exercise 2.1
#+begin_src scheme :exports both :results output
  (define (make-rat n d)
    (define (normalize n d)
      (if (> 0 d)
	  (cons (- 0 n) (- 0 d))
	  (cons n d)))
    (let* ((normalized (normalize n d))
	   (n (car normalized))
	   (d (cdr normalized))
	   (g (gcd n d)))
      (cons (/ n g) 
	    (/ d g))))

  (print-rat (make-rat 3 4))
  (print-rat (make-rat -3 -4))
  (print-rat (make-rat -3 4))
  (print-rat (make-rat 3 -4))
#+end_src

#+RESULTS:
: ;=> 
: 3/4
: 3/4
: -3/4
: -3/4

